## Inspecting and cleaning the datasets

First, let's take a look at the data that we have been provided

In [1]:
%pylab inline
import pandas as pd

Populating the interactive namespace from numpy and matplotlib

In [2]:
#reading the 'Working Days' file
working_days = pd.ExcelFile('Exercise - Working Days calendar - FOR CANDIDATE-SENT - SHORT.xlsx')

In [3]:
#Taking a look at the sheets we have
working_days.sheet_names

['Weekdays', 'Calendar']

In [4]:
#Creating a dictionary (workingdays_df), that contains a dataframe for every sheet_name
workingdays_df = {sh:working_days.parse(sh) for sh in working_days.sheet_names}

In [5]:
#taking a look at the 'Weekdays'
weekdays = workingdays_df['Weekdays']
weekdays.head(10)

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Memo: Working Days
2,NaN,Month-Year,#Mon,#Tue,#Wed,#Thu,#Fri,#Sat,#Sun,Total Weekdays,Country 1
3,NaN,2015-01-01 00:00:00,4,4,4,5,5,5,4,31,21
4,NaN,2015-02-02 00:00:00,4,4,4,4,4,4,4,28,20
5,NaN,2015-03-03 00:00:00,5,5,4,4,4,4,5,31,22
6,NaN,2015-04-04 00:00:00,4,4,5,5,4,4,4,30,22
7,NaN,2015-05-05 00:00:00,4,4,4,4,5,5,5,31,20
8,NaN,2015-06-06 00:00:00,5,5,4,4,4,4,4,30,22
9,NaN,2015-07-07 00:00:00,4,4,5,5,5,4,4,31,23

That is a very messy df. Let's try to clean it a little bit.

In [6]:
#let's take a look at the lenght of the df
len(weekdays)

41

In [7]:
#let's take a look at the info
weekdays.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 41 entries, 0 to 40
Data columns (total 11 columns):
Unnamed: 0     0 non-null float64
Unnamed: 1     39 non-null object
Unnamed: 2     39 non-null object
Unnamed: 3     39 non-null object
Unnamed: 4     39 non-null object
Unnamed: 5     39 non-null object
Unnamed: 6     39 non-null object
Unnamed: 7     39 non-null object
Unnamed: 8     39 non-null object
Unnamed: 9     39 non-null object
Unnamed: 10    40 non-null object
dtypes: float64(1), object(10)
memory usage: 3.6+ KB

In [8]:
#getting rid of the first column
del weekdays['Unnamed: 0']
weekdays.head()

,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,Memo: Working Days
2,Month-Year,#Mon,#Tue,#Wed,#Thu,#Fri,#Sat,#Sun,Total Weekdays,Country 1
3,2015-01-01 00:00:00,4,4,4,5,5,5,4,31,21
4,2015-02-02 00:00:00,4,4,4,4,4,4,4,28,20

In [9]:
#dropping the first two rows
weekdays = weekdays.iloc[2:]
weekdays.head()

,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10
2,Month-Year,#Mon,#Tue,#Wed,#Thu,#Fri,#Sat,#Sun,Total Weekdays,Country 1
3,2015-01-01 00:00:00,4,4,4,5,5,5,4,31,21
4,2015-02-02 00:00:00,4,4,4,4,4,4,4,28,20
5,2015-03-03 00:00:00,5,5,4,4,4,4,5,31,22
6,2015-04-04 00:00:00,4,4,5,5,4,4,4,30,22

In [10]:
#getting the right headers
new_header = weekdays.iloc[0] 
weekdays = weekdays[1:] 
weekdays.columns = new_header
weekdays.head()

2,Month-Year,#Mon,#Tue,#Wed,#Thu,#Fri,#Sat,#Sun,Total Weekdays,Country 1
3,2015-01-01 00:00:00,4,4,4,5,5,5,4,31,21
4,2015-02-02 00:00:00,4,4,4,4,4,4,4,28,20
5,2015-03-03 00:00:00,5,5,4,4,4,4,5,31,22
6,2015-04-04 00:00:00,4,4,5,5,4,4,4,30,22
7,2015-05-05 00:00:00,4,4,4,4,5,5,5,31,20

In [11]:
#finding a more descriptive name for the last column
weekdays = weekdays.rename(columns={'Country 1': 'working_days'})
weekdays.head()

2,Month-Year,#Mon,#Tue,#Wed,#Thu,#Fri,#Sat,#Sun,Total Weekdays,working_days
3,2015-01-01 00:00:00,4,4,4,5,5,5,4,31,21
4,2015-02-02 00:00:00,4,4,4,4,4,4,4,28,20
5,2015-03-03 00:00:00,5,5,4,4,4,4,5,31,22
6,2015-04-04 00:00:00,4,4,5,5,4,4,4,30,22
7,2015-05-05 00:00:00,4,4,4,4,5,5,5,31,20

In [45]:
weekdays.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38 entries, 3 to 40
Data columns (total 10 columns):
Month-Year        38 non-null object
#Mon              38 non-null object
#Tue              38 non-null object
#Wed              38 non-null object
#Thu              38 non-null object
#Fri              38 non-null object
#Sat              38 non-null object
#Sun              38 non-null object
Total Weekdays    38 non-null object
working_days      38 non-null object
dtypes: object(10)
memory usage: 3.1+ KB

In [60]:
#let's now convert the numeric values 
weekdays.columns

Index(['Month-Year', '#Mon', '#Tue', '#Wed', '#Thu', '#Fri', '#Sat', '#Sun',
       'Total Weekdays', 'working_days'],
      dtype='object', name=2)

In [61]:
int_columns = ['#Mon', '#Tue', '#Wed', '#Thu', '#Fri', '#Sat', '#Sun',
       'Total Weekdays', 'working_days']
weekdays[int_columns] = weekdays[int_columns].apply(pd.to_numeric, errors='coerce')

In [62]:
weekdays.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 38 entries, 3 to 40
Data columns (total 10 columns):
Month-Year        38 non-null object
#Mon              38 non-null int64
#Tue              38 non-null int64
#Wed              38 non-null int64
#Thu              38 non-null int64
#Fri              38 non-null int64
#Sat              38 non-null int64
#Sun              38 non-null int64
Total Weekdays    38 non-null int64
working_days      38 non-null int64
dtypes: int64(9), object(1)
memory usage: 3.1+ KB

Taking a look at the second sheet

In [12]:
#taking a look at the second sheet
calendar = workingdays_df['Calendar']

In [13]:
calendar.head(10)

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Holiday is marked as 0
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,Date,Month-Year,Day,Year,Month,Month,Day,Country 1
3,Jan2015,2015-01-01 00:00:00,2015-01-01 00:00:00,Thursday,2015,01,Jan,01,0
4,Jan2015,2015-01-02 00:00:00,2015-01-02 00:00:00,Friday,2015,01,Jan,02,1
5,Jan2015,2015-01-03 00:00:00,2015-01-03 00:00:00,Saturday,2015,01,Jan,03,0
6,Jan2015,2015-01-04 00:00:00,2015-01-04 00:00:00,Sunday,2015,01,Jan,04,0
7,Jan2015,2015-01-05 00:00:00,2015-01-05 00:00:00,Monday,2015,01,Jan,05,1
8,Jan2015,2015-01-06 00:00:00,2015-01-06 00:00:00,Tuesday,2015,01,Jan,06,1
9,Jan2015,2015-01-07 00:00:00,2015-01-07 00:00:00,Wednesday,2015,01,Jan,07,1

In [14]:
len(calendar)

1158

In [15]:
#Let's clean this one up aswell
calendar.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1158 entries, 0 to 1157
Data columns (total 9 columns):
Unnamed: 0                1155 non-null object
Unnamed: 1                1156 non-null object
Unnamed: 2                1156 non-null object
Unnamed: 3                1156 non-null object
Unnamed: 4                1156 non-null object
Unnamed: 5                1156 non-null object
Unnamed: 6                1156 non-null object
Unnamed: 7                1156 non-null object
Holiday is marked as 0    1156 non-null object
dtypes: object(9)
memory usage: 81.5+ KB

In [16]:
#dropping the first two rows
calendar = calendar.iloc[2:]
calendar.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Holiday is marked as 0
2,NaN,Date,Month-Year,Day,Year,Month,Month,Day,Country 1
3,Jan2015,2015-01-01 00:00:00,2015-01-01 00:00:00,Thursday,2015,01,Jan,01,0
4,Jan2015,2015-01-02 00:00:00,2015-01-02 00:00:00,Friday,2015,01,Jan,02,1
5,Jan2015,2015-01-03 00:00:00,2015-01-03 00:00:00,Saturday,2015,01,Jan,03,0
6,Jan2015,2015-01-04 00:00:00,2015-01-04 00:00:00,Sunday,2015,01,Jan,04,0

In [17]:
#getting the right headers
new_header = calendar.iloc[0] 
calendar = calendar[1:] 
calendar.columns = new_header
calendar.head()

2,nan,Date,Month-Year,Day,Year,Month,Month,Day,Country 1
3,Jan2015,2015-01-01 00:00:00,2015-01-01 00:00:00,Thursday,2015,01,Jan,01,0
4,Jan2015,2015-01-02 00:00:00,2015-01-02 00:00:00,Friday,2015,01,Jan,02,1
5,Jan2015,2015-01-03 00:00:00,2015-01-03 00:00:00,Saturday,2015,01,Jan,03,0
6,Jan2015,2015-01-04 00:00:00,2015-01-04 00:00:00,Sunday,2015,01,Jan,04,0
7,Jan2015,2015-01-05 00:00:00,2015-01-05 00:00:00,Monday,2015,01,Jan,05,1

In [22]:
#finding a more descriptive name for the first and last column
calendar = calendar.rename(columns={calendar.columns[0]: 'str_month_year', 'Country 1': 'Holiday_is_0'})
calendar.head()

2,str_month_year,Date,Month-Year,Day,Year,Month,Month,Day,Holiday_is_0
3,Jan2015,2015-01-01 00:00:00,2015-01-01 00:00:00,Thursday,2015,01,Jan,01,0
4,Jan2015,2015-01-02 00:00:00,2015-01-02 00:00:00,Friday,2015,01,Jan,02,1
5,Jan2015,2015-01-03 00:00:00,2015-01-03 00:00:00,Saturday,2015,01,Jan,03,0
6,Jan2015,2015-01-04 00:00:00,2015-01-04 00:00:00,Sunday,2015,01,Jan,04,0
7,Jan2015,2015-01-05 00:00:00,2015-01-05 00:00:00,Monday,2015,01,Jan,05,1

Moving on to the next file

In [39]:
#reading the daily sales file
daily_sales = pd.read_csv('Exercise - Daily Sales - FOR CANDIDATE-SENT - SHORT.csv')

In [40]:
len(daily_sales)

634

In [41]:
daily_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 634 entries, 0 to 633
Data columns (total 4 columns):
Country         634 non-null object
Posting Date    634 non-null object
Brand           634 non-null object
Daily Sales     634 non-null object
dtypes: object(4)
memory usage: 19.9+ KB

In [42]:
daily_sales.columns

Index(['Country', 'Posting Date', 'Brand', 'Daily Sales'], dtype='object')

In [43]:
daily_sales.head()

     Country Posting Date    Brand Daily Sales
0  Country 1   02.01.2015  Brand A   30,785.22
1  Country 1   05.01.2015  Brand A   18,256.02
2  Country 1   06.01.2015  Brand A   24,168.04
3  Country 1   07.01.2015  Brand A    3,858.65
4  Country 1   12.01.2015  Brand A    1,229.33

In [66]:
daily_sales['Daily Sales'] = daily_sales['Daily Sales'].astype(dtype=float)

ValueError: could not convert string to float: '30,785.22'

In [64]:
daily_sales['Daily Sales'] = daily_sales['Daily Sales'].apply(pd.to_numeric, errors='coerce')

ValueError: could not convert string to float: '30,785.22'

In [44]:
daily_sales.describe()

          Country Posting Date    Brand Daily Sales
count         634          634      634         634
unique          1          634        1         621
top     Country 1   22.01.2018  Brand A       10.05
freq          634            1      634           4

In [37]:
lo_actual = pd.read_excel

In [38]:
lo_actual.head()

  Submission  Year  Month  Country 1 - Brand A
0     Actual  2015      1             224134.6
1     Actual  2015      2             184817.6
2     Actual  2015      3             249555.0
3     Actual  2015      4             245542.0
4     Actual  2015      5             221473.8